In [ ]:
# Lista -> []
# Tupla -> ()
# Diccionario -> {}

In [ ]:
# pandas
# Dataframe

import pandas as pd

data = [ ['Juan', 25], ['Pedro', 34], ['Luis', 45] ]

df = pd.DataFrame(data, columns=['Nombre', 'Edad'])

In [ ]:
df

  Nombre  Edad
0   Juan    25
1  Pedro    34
2   Luis    45

In [3]:
data = {
    'Nombre': ['Juan', 'Pedro', 'Luis'],
    'Edad': [25, 26, 34]
}

df = pd.DataFrame(data)
df

  Nombre  Edad
0   Juan    25
1  Pedro    26
2   Luis    34

In [4]:
df = pd.read_csv('./utils/data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [ ]:
df = pd.read_csv('./utils/data/data', sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [9]:
df = pd.read_csv('./utils/data/data_without_header', sep='-', header=None, names=['nombre', 'edad', 'ciudad'])
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [10]:
df = pd.read_json('./utils/data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [11]:
# Obtener estadisticas descriptiva
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [14]:
# Muestar de datos
df.head(5)

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [16]:
df.tail(2)

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [20]:
# Obtener nombre de las columnas
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [ ]:
# Obtiene informacion del indice
df.index

RangeIndex(start=0, stop=3, step=1)

In [24]:
df.count()

nombre    3
edad      3
ciudad    3
dtype: int64

In [27]:
# Seleccionar una columna
print( df['ciudad'])

# Seleccionar varias columnas
print(df[['nombre', 'edad']])

0       Madrid
1    Barcelona
2      Sevilla
Name: ciudad, dtype: object
  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [32]:
# Seleccionar fila por indice
print(df.loc[0])

# Seleccionar varias filas
print("#### \n")
print(df.loc[[0,2]])

# Seleccionar filas por condicion
print("#### \n")
print(df[df['edad']>30])

nombre      Juan
edad          25
ciudad    Madrid
Name: 0, dtype: object
####

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla
####

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [33]:
# Agrupar datos y aplicar agregaciones

data = {'Grupo': ['A', 'B', 'A', 'B', 'A', 'B'],
        'Valor': [10, 20, 15, 25, 12, 18]}
df = pd.DataFrame(data)

promedio_por_grupo = df.groupby('Grupo').mean()
print(promedio_por_grupo)

suma_por_grupo = df.groupby('Grupo').sum()
print(suma_por_grupo)

           Valor
Grupo
A      12.333333
B      21.000000
       Valor
Grupo
A         37
B         63

In [34]:
df = pd.read_csv('./utils/data/data', sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [ ]:
# Elimianr filas con datos faltantes
df_sin_na = df.dropna()
print(df_sin_na)

print('\n')

df_completo = df.fillna(value=0)
print(df_completo)

  nombre  edad     ciudad
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla


  nombre  edad     ciudad
0   Juan     0     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [41]:
df_sin_na = df.dropna(subset=['edad'])
print(df_sin_na)

  nombre  edad     ciudad
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [43]:
data = {
    'A': [1, 2, 3, 4],
    'B': [6, 7, 8, 9]
}

df = pd.DataFrame(data)
df

   A  B
0  1  6
1  2  7
2  3  8
3  4  9

In [45]:
def multiplo2(x):
    return x*2

In [46]:
df['A_doble2'] = df['A'].apply(multiplo2)
df

   A  B  A_doble  A_doble2
0  1  6        2         2
1  2  7        4         4
2  3  8        6         6
3  4  9        8         8

In [ ]:
df['A_doble'] = df['A'].apply(lambda x: x * 2)
df

   A  B  A_doble
0  1  6        2
1  2  7        4
2  3  8        6
3  4  9        8

In [48]:
def suma(row):
    return row['A'] + row['B']

In [47]:
df['suma'] = df.apply(lambda row: row['A'] + row['B'], axis=1 )
df

   A  B  A_doble  A_doble2  suma
0  1  6        2         2     7
1  2  7        4         4     9
2  3  8        6         6    11
3  4  9        8         8    13